#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stum0/nostr_mempool_bot/runs/run-2GZiDu22aTqcgrVF

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
random_string.suffix: Refreshing state... [id=PikCUHsT]
data.aws_availability_zones.available: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/education-eks-PikCUHsT/cluster]
module.eks.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-09a308ecae141b39e]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=493031039834]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=493031039834]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01e7052b8ee37caf8]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=education-eks-PikCUHsT-cluster-20221107015218417200000001]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=education-eks-PikCUHsT-cluster-20221107015218417200000001-20221107015219126900000002]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=education-eks-PikCUHsT-cluster-20221107015218417200000001-20221107015219150100000003]
aws_security_group.node_group_one: Refreshing state... [id=sg-0600b56eaa1ddeeef]
aws_security_group.node_group_two: Refreshing state... [id=sg-0460a4acf8143625c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-028c388a1a82570a1]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-055591514ea7ba467]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00f1647268f77adb5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0027f294c0687e005]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-074259d4ab3b2e650]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-09e2f860155ba1a0f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-044d1fcb5706092c5]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f1a1e204efcb3fc9]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03740b5c99b3fa06f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d5be3d1cea332b9e]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-011e367c23e6f1850]
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Read complete after 0s [id=493031039834]
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Read complete after 0s [id=493031039834]
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["one"].aws_iam_role.this[0]: Refreshing state... [id=node-group-1-eks-node-group-20221107015236407400000008]
module.eks.module.eks_managed_node_group["two"].aws_iam_role.this[0]: Refreshing state... [id=node-group-2-eks-node-group-20221107015236407800000009]
module.eks.module.eks_managed_node_group["two"].module.user_data.data.cloudinit_config.linux_eks_managed_node_group[0]: Reading...
module.eks.module.eks_managed_node_group["two"].module.user_data.data.cloudinit_config.linux_eks_managed_node_group[0]: Read complete after 0s [id=329915227]
module.eks.module.eks_managed_node_group["one"].module.user_data.data.cloudinit_config.linux_eks_managed_node_group[0]: Reading...
module.eks.module.eks_managed_node_group["one"].module.user_data.data.cloudinit_config.linux_eks_managed_node_group[0]: Read complete after 0s [id=329915227]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-055591514ea7ba4671080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-071b875283e6cd8e5]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-035b92a2ad5ff3379]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e199b2ab8ab55376]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0a72b99937b73d026]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00c4e30ea773f8449]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a92627984120df41]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a8af4d80977df0fa]
module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1369769085]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3757099341]
module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-3754067483]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2075093666]
module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-1805045596]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3321846439]
module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-1168537055]
module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-3840306636]
module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-2591574209]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3902320468]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1084650901]
module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-3703460206]
module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-3103619387]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-011e367c23e6f18501080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=education-eks-PikCUHsT]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-1-eks-node-group-20221107015236407400000008-2022110701523703260000000e]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-1-eks-node-group-20221107015236407400000008-2022110701523702950000000c]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-2-eks-node-group-20221107015236407800000009-2022110701523697420000000b]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-1-eks-node-group-20221107015236407400000008-2022110701523704790000000f]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-2-eks-node-group-20221107015236407800000009-2022110701523702970000000d]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-2-eks-node-group-20221107015236407800000009-2022110701523696990000000a]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::493031039834:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/04C176803651602D87E60872A4F23156]
module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0]: Refreshing state... [id=lt-0fda2132fbe3f791f]
module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0]: Refreshing state... [id=lt-0224b50ce2c7cad03]
module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0]: Refreshing state... [id=education-eks-PikCUHsT:node-group-1-20221107020124150900000014]
module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0]: Refreshing state... [id=education-eks-PikCUHsT:node-group-2-20221107020124151100000016]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-01fdfe9f25167f9c1"
        id                   = "eipalloc-01e7052b8ee37caf8"
      + network_interface    = "eni-00344150c2a6323aa"
      + private_dns          = "ip-10-0-4-205.eu-west-2.compute.internal"
      + private_ip           = "10.0.4.205"
        tags                 = {
            "Name" = "nostr_project-eu-west-2a"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-011e367c23e6f1850"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0e199b2ab8ab55376"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "nostr_project-private"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-055591514ea7ba467"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0d5be3d1cea332b9e"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "nostr_project-public"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] must be replaced
+/- resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:eu-west-2:493031039834:log-group:/aws/eks/education-eks-PikCUHsT/cluster" -> (known after apply)
      ~ id                = "/aws/eks/education-eks-PikCUHsT/cluster" -> (known after apply)
      ~ name              = "/aws/eks/education-eks-PikCUHsT/cluster" -> "/aws/eks/nostr-test-PikCUHsT/cluster" # forces replacement
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:eu-west-2:493031039834:cluster/education-eks-PikCUHsT" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1URXdOekF4TlRjME9Wb1hEVE15TVRFd05EQXhOVGMwT1Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTTk3CkJlZVF0NlBxZkp4b1Q4dzUzU29WQ251RjFUdGdPaXVaQ3Y4NFlBUnJjRHNaQXhHN05lNkJKRUIvL1dEbi9GT2IKQXVmNjl6SXFSdTl3czhac0xINEpGVWZkNDNmRm5aZlhRYWJSZ2kzK2hXbEtiVC9JRFFwcVVqSGpKRVhlc2lhVAorVGRHOC9COVY4Q0syTVQ2TnVXeWdGVTljU203MDdOdjhKYjFBbytQb2ROWUJ1aklmdWdhV21sUEtnZERWQmh5CmRqZWpMQ05kOEtWcnAwRFRTaUtWS2lFbU03cWdNVkhKdGxLVlZYS0JSSlhQVGNTOG1FT3BoVWNveWx6d3pLTUwKSzdqMmZzUXAwSHo0enduOGVBdVNKMkVVcTk2UnU3clN4V0hpVTBCSGhmMXZ5aWg4a21tRUw4TCt6cWZKbVB3Two0WXBOd29nSDhIZGFIQjBId3VzQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDQUs1UGdBc1F6dU5YbTNSaWdHQXV5dVlRM1NNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBQmdXbWFLakZCeGg0UWd2cEpvRQpPS2syQTc2dnZDc1V3TS82NmJXVkI3MHJlazRMWUpKRkRrKzhYcllzcWR6QTB5TmxHWStrelQ2cWxpbXpZT056CmpIK2l2SlZ2RkczSE4wK3hiVVdvZ21KdkpvOXU2Yi9LZTc2QVRtM24yUHVVdlQ5ams4YnhadEpkczdGRit3VHAKYXM1bXBuazN2aWVpWmgwRGt0VDBBV0pnMXRmZkEva1Q0N1VqTytzVHRMdFdOU0pFbURLTXQ3OWpzajhCZWd5OQpSVDdoN3ltb3JNNlJlT0YweUEybjlZOHZ6Q3pCRVFkSWxsd0JncEMwME9DWTRmckE3ZC9wemIrZnRTQ3NhM2RpCnpBNUN6emY0Ny9KWnlFaGZOMzArZGhkektFUlhCRHp1OTNKVWZ0d1lob2l1U0JnN054dkJWaTdXZ3VRK0NOWnQKWGR3PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2022-11-07 01:52:41.082 +0000 UTC" -> (known after apply)
      ~ endpoint                  = "https://04C176803651602D87E60872A4F23156.gr7.eu-west-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "education-eks-PikCUHsT" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.eu-west-2.amazonaws.com/id/04C176803651602D87E60872A4F23156"
                    },
                ]
            },
        ] -> (known after apply)
      ~ name                      = "education-eks-PikCUHsT" -> "nostr-test-PikCUHsT" # forces replacement
      ~ platform_version          = "eks.7" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::493031039834:role/education-eks-PikCUHsT-cluster-20221107015218417200000001" -> (known after apply) # forces replacement
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ version                   = "1.22" -> "1.25"
        # (1 unchanged attribute hidden)

      ~ kubernetes_network_config {
          ~ ip_family         = "ipv4" -> (known after apply)
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-025e4ee903bdb6089" -> (known after apply)
          ~ security_group_ids        = [
              - "sg-074259d4ab3b2e650",
            ] -> (known after apply) # forces replacement
          ~ vpc_id                    = "vpc-09a308ecae141b39e" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::493031039834:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/04C176803651602D87E60872A4F23156" -> (known after apply)
      ~ id              = "arn:aws:iam::493031039834:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/04C176803651602D87E60872A4F23156" -> (known after apply)
      ~ tags            = {
          ~ "Name" = "education-eks-PikCUHsT-eks-irsa" -> "nostr-test-PikCUHsT-eks-irsa"
        }
      ~ tags_all        = {
          ~ "Name" = "education-eks-PikCUHsT-eks-irsa" -> "nostr-test-PikCUHsT-eks-irsa"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
      ~ url             = "oidc.eks.eu-west-2.amazonaws.com/id/04C176803651602D87E60872A4F23156" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role.this[0] must be replaced
+/- resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::493031039834:role/education-eks-PikCUHsT-cluster-20221107015218417200000001" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks.amazonaws.com"
                        }
                        Sid       = "EKSClusterAssumeRole"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2022-11-07T01:52:18Z" -> (known after apply)
      ~ id                    = "education-eks-PikCUHsT-cluster-20221107015218417200000001" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
      ~ name                  = "education-eks-PikCUHsT-cluster-20221107015218417200000001" -> (known after apply)
      ~ name_prefix           = "education-eks-PikCUHsT-cluster-" -> "nostr-test-PikCUHsT-cluster-" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAXFSXQUNNI3EFOYP3C" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "education-eks-PikCUHsT-cluster" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Deny"
                          - Resource = "arn:aws:logs:eu-west-2:493031039834:log-group:/aws/eks/education-eks-PikCUHsT/cluster"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "nostr-test-PikCUHsT-cluster"
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "education-eks-PikCUHsT-cluster-20221107015218417200000001-20221107015219126900000002" -> (known after apply)
      ~ role       = "education-eks-PikCUHsT-cluster-20221107015218417200000001" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "education-eks-PikCUHsT-cluster-20221107015218417200000001-20221107015219150100000003" -> (known after apply)
      ~ role       = "education-eks-PikCUHsT-cluster-20221107015218417200000001" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_security_group.cluster[0] must be replaced
+/- resource "aws_security_group" "cluster" {
      ~ arn                    = "arn:aws:ec2:eu-west-2:493031039834:security-group/sg-074259d4ab3b2e650" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node groups"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-09e2f860155ba1a0f",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node kubelets"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-09e2f860155ba1a0f",
                ]
              - self             = false
              - to_port          = 10250
            },
        ] -> (known after apply)
      ~ id                     = "sg-074259d4ab3b2e650" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Node groups to cluster API"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-09e2f860155ba1a0f",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "education-eks-PikCUHsT-cluster-20221107015230060800000004" -> (known after apply)
      ~ name_prefix            = "education-eks-PikCUHsT-cluster-" -> "nostr-test-PikCUHsT-cluster-" # forces replacement
      ~ owner_id               = "493031039834" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "education-eks-PikCUHsT-cluster" -> "nostr-test-PikCUHsT-cluster"
        }
      ~ tags_all               = {
          ~ "Name" = "education-eks-PikCUHsT-cluster" -> "nostr-test-PikCUHsT-cluster"
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.node[0] must be replaced
+/- resource "aws_security_group" "node" {
      ~ arn                    = "arn:aws:ec2:eu-west-2:493031039834:security-group/sg-09e2f860155ba1a0f" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Egress NTP/TCP to internet"
              - from_port        = 123
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 123
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Egress NTP/UDP to internet"
              - from_port        = 123
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = false
              - to_port          = 123
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Egress all HTTPS to internet"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Node groups to cluster API"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-074259d4ab3b2e650",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
        ] -> (known after apply)
      ~ id                     = "sg-09e2f860155ba1a0f" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node groups"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-074259d4ab3b2e650",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node kubelets"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-074259d4ab3b2e650",
                ]
              - self             = false
              - to_port          = 10250
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
        ] -> (known after apply)
      ~ name                   = "education-eks-PikCUHsT-node-20221107015230069200000007" -> (known after apply)
      ~ name_prefix            = "education-eks-PikCUHsT-node-" -> "nostr-test-PikCUHsT-node-" # forces replacement
      ~ owner_id               = "493031039834" -> (known after apply)
      ~ tags                   = {
          ~ "Name"                                         = "education-eks-PikCUHsT-node" -> "nostr-test-PikCUHsT-node"
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "owned" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "owned"
        }
      ~ tags_all               = {
          ~ "Name"                                         = "education-eks-PikCUHsT-node" -> "nostr-test-PikCUHsT-node"
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "owned" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "owned"
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_443"] must be replaced
+/- resource "aws_security_group_rule" "cluster" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-3103619387" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-074259d4ab3b2e650" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] must be replaced
+/- resource "aws_security_group_rule" "cluster" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-3703460206" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-074259d4ab3b2e650" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] must be replaced
+/- resource "aws_security_group_rule" "cluster" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-1084650901" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-074259d4ab3b2e650" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_cluster_443"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-1805045596" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-074259d4ab3b2e650" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_https"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-1168537055" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_tcp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-2591574209" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_udp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3840306636" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-1369769085" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-3754067483" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-3321846439" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-074259d4ab3b2e650" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-3902320468" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-074259d4ab3b2e650" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-3757099341" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-2075093666" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_id        = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-09e2f860155ba1a0f" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0f1a1e204efcb3fc9"
      ~ tags                                           = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-03740b5c99b3fa06f"
      ~ tags                                           = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-044d1fcb5706092c5"
      ~ tags                                           = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0027f294c0687e005"
      ~ tags                                           = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-028c388a1a82570a1"
      ~ tags                                           = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-00f1647268f77adb5"
      ~ tags                                           = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "kubernetes.io/cluster/education-eks-PikCUHsT" = "shared" -> null
          + "kubernetes.io/cluster/nostr-test-PikCUHsT"    = "shared"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:eu-west-2:493031039834:nodegroup/education-eks-PikCUHsT/node-group-1-20221107020124150900000014/eac227e9-1509-950f-b097-272f8da30ca2" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ cluster_name           = "education-eks-PikCUHsT" -> "nostr-test-PikCUHsT" # forces replacement
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "education-eks-PikCUHsT:node-group-1-20221107020124150900000014" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "node-group-1-20221107020124150900000014" -> (known after apply)
      ~ release_version        = "1.22.12-20221101" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-node-group-1-20221107020124150900000014-eac227e9-1509-950f-b097-272f8da30ca2"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "node-group-1"
        }
      ~ version                = "1.22" -> "1.25"
        # (6 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-0224b50ce2c7cad03" -> (known after apply)
            name    = "one-20221107020123486200000010"
          ~ version = "1" -> (known after apply)
        }

      ~ update_config {
          ~ max_unavailable            = 1 -> (known after apply)
          ~ max_unavailable_percentage = 0 -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-0224b50ce2c7cad03"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "one-20221107020123486200000010"
        tags                    = {}
      ~ vpc_security_group_ids  = [
          - "sg-025e4ee903bdb6089",
          - "sg-0600b56eaa1ddeeef",
          - "sg-09e2f860155ba1a0f",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:eu-west-2:493031039834:nodegroup/education-eks-PikCUHsT/node-group-2-20221107020124151100000016/2ec227e9-1506-a1a7-4941-c90f243c38f2" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ cluster_name           = "education-eks-PikCUHsT" -> "nostr-test-PikCUHsT" # forces replacement
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "education-eks-PikCUHsT:node-group-2-20221107020124151100000016" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "node-group-2-20221107020124151100000016" -> (known after apply)
      ~ release_version        = "1.22.12-20221101" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-node-group-2-20221107020124151100000016-2ec227e9-1506-a1a7-4941-c90f243c38f2"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "node-group-2"
        }
      ~ version                = "1.22" -> "1.25"
        # (6 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-0fda2132fbe3f791f" -> (known after apply)
            name    = "two-20221107020123488700000012"
          ~ version = "1" -> (known after apply)
        }

      ~ update_config {
          ~ max_unavailable            = 1 -> (known after apply)
          ~ max_unavailable_percentage = 0 -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-0fda2132fbe3f791f"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "two-20221107020123488700000012"
        tags                    = {}
      ~ vpc_security_group_ids  = [
          - "sg-025e4ee903bdb6089",
          - "sg-0460a4acf8143625c",
          - "sg-09e2f860155ba1a0f",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 23 to add, 8 to change, 23 to destroy.

Changes to Outputs:
  ~ cluster_endpoint          = "https://04C176803651602D87E60872A4F23156.gr7.eu-west-2.eks.amazonaws.com" -> (known after apply)
  ~ cluster_id                = "education-eks-PikCUHsT" -> (known after apply)
  ~ cluster_name              = "education-eks-PikCUHsT" -> "nostr-test-PikCUHsT"
  ~ cluster_security_group_id = "sg-074259d4ab3b2e650" -> (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-2GZiDu22aTqcgrVF/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-2GZiDu22aTqcgrVF/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @stum0, Action: `pull_request`*